waiter_app/app/views/dishes/show.html.erb

  <h4>Ingredients:</h4>
  <% @dish.ingredients.each do |ing| %>
---
SELECT  "ingredients".* FROM "ingredients" INNER JOIN "ingredients_dishes" ON "ingredients"."id" = "ingredients_dishes"."ingredient_id" WHERE "ingredients_dishes"."dish_id" = $1 ORDER BY "ingredients"."id" ASC LIMIT $2  [["dish_id", 5], ["LIMIT", 1]]