waiter_app/app/views/users/index.html.erb

    <p><%=user[:email]%>:</p>
    <% user.dishes.each do |dish| %>
---
SELECT "dishes".* FROM "dishes" INNER JOIN "user_dishes" ON "dishes"."id" = "user_dishes"."dish_id" WHERE "user_dishes"."user_id" = $1  [["user_id", 1]]

    <strong>Alergies:</strong>
    <% user.ingredients.each do |ingredient| %>
---
SELECT "ingredients".* FROM "ingredients" INNER JOIN "user_ingredients" ON "ingredients"."id" = "user_ingredients"."ingredient_id" WHERE "user_ingredients"."user_id" = $1  [["user_id", 1]]