waiter_app/app/views/users/show.html.erb

SELECT "dishes".* FROM "dishes" INNER JOIN "user_dishes" ON "dishes"."id" = "user_dishes"."dish_id" WHERE "user_dishes"."user_id" = $1  [["user_id", 2]]
---
<%= link_to "Add some dishes!", dishes_path %>
<% if @user.dishes.length > 0 %>

SELECT "ingredients".* FROM "ingredients" INNER JOIN "user_ingredients" ON "ingredients"."id" = "user_ingredients"."ingredient_id" WHERE "user_ingredients"."user_id" = $1  [["user_id", 2]]
---
<% end %>
<% if @user.ingredients.length > 0 %>