waiter_app/app/controllers/dishes_controller.rb

  def show
    @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @dish = Dish.new(dish_params)
    if @dish.save
---
INSERT INTO "dishes" ("name", "description", "course", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "sdfadsf"], ["description", "adsfasdf"], ["course", 1], ["created_at", "2018-04-04 12:08:19.605918"], ["updated_at", "2018-04-04 12:08:19.605918"]]

  def edit
    @dish = Dish.find(params[:id])
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def update
    @dish = Dish.find(params[:id])
    if @dish.update(dish_params)
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "dishes" SET "description" = $1, "course" = $2, "updated_at" = $3 WHERE "dishes"."id" = $4  [["description", "This ain't yo mama's chicken parm. salad"], ["course", 1], ["updated_at", "2018-04-04 16:07:25.242146"], ["id", 1]]

  def destroy
    @dish = Dish.find(params[:id])
    @dish.delete
---
SELECT  "dishes".* FROM "dishes" WHERE "dishes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "dishes" WHERE "dishes"."id" = $1  [["id", 3]]