waiter_app/app/controllers/ingredients_dishes_controller.rb

SELECT "dishes".* FROM "dishes"
---
  def new
    p "I am the controller params", params
    @dishes = Dish.all

INSERT INTO "ingredients_dishes" ("ingredient_id", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ingredient_id", 25], ["dish_id", 3], ["created_at", "2018-04-05 00:44:00.454182"], ["updated_at", "2018-04-05 00:44:00.454182"]]
---
  def create
    p "I hit my route successfully", ingredients_dish_params
    @ingredients_dish = IngredientsDish.new(ingredients_dish_params)
    if @ingredients_dish.save

SELECT  "ingredients_dishes".* FROM "ingredients_dishes" WHERE "ingredients_dishes"."ingredient_id" = $1 AND "ingredients_dishes"."dish_id" = $2 LIMIT $3  [["ingredient_id", 25], ["dish_id", 3], ["LIMIT", 1]]
DELETE FROM "ingredients_dishes" WHERE "ingredients_dishes"."id" = $1  [["id", 17]]
---
  def destroy
     new_params = {ingredient_id: params[:ingredient_id][0].to_i, dish_id: params[:dish_id][0].to_i}
     @join = IngredientsDish.find_by(new_params)
     @join.delete