waiter_app/app/controllers/ingredients_controller.rb

  def new
    @dishes = Dish.all
---
SELECT "dishes".* FROM "dishes"

  def create
    if (params[:dish] == "NONE")
      @ingredient = Ingredient.new(ingredient_params)
        if @ingredient.save
          redirect_to ingredients_path
        else
          redirect_to new_ingredient_path
        end
    else
      @ingredient = Ingredient.new(ingredient_params)
        if @ingredient.save
          @new_params = {ingredient_id: @ingredient[:id], dish_id:params[:dish_id].to_i}
          @join = IngredientsDish.create(@new_params)
---
INSERT INTO "ingredients" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Is this working now?"], ["description", "Please work!!!!!!"], ["created_at", "2018-04-04 12:24:01.840374"], ["updated_at", "2018-04-04 12:24:01.840374"]]
INSERT INTO "ingredients_dishes" ("ingredient_id", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["ingredient_id", 23], ["dish_id", 1], ["created_at", "2018-04-04 12:53:22.120012"], ["updated_at", "2018-04-04 12:53:22.120012"]]

  def edit
    @ingredient = Ingredient.find(params[:id])
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update
    @ingredient = Ingredient.find(params[:id])
    if @ingredient.update(ingredient_params)
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "ingredients" SET "description" = $1, "updated_at" = $2 WHERE "ingredients"."id" = $3  [["description", "How can so boring taste so delicious?"], ["updated_at", "2018-04-04 15:14:25.905314"], ["id", 2]]

  def destroy
    @ingredient = Ingredient.find(params[:id])
    @ingredient.delete
---
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "ingredients" WHERE "ingredients"."id" = $1  [["id", 2]]