waiter_app/app/controllers/user_ingredients_controller.rb

INSERT INTO "user_ingredients" ("user_id", "ingredient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["ingredient_id", 27], ["created_at", "2018-04-04 19:48:50.227882"], ["updated_at", "2018-04-04 19:48:50.227882"]]
---
  def create
    new_params = {ingredient_id: params[:ingredient_id][0].to_i, user_id: params[:user_id][0].to_i}
    @join = UserIngredient.create(new_params)

SELECT  "user_ingredients".* FROM "user_ingredients" WHERE "user_ingredients"."user_id" = $1 AND "user_ingredients"."ingredient_id" = $2 LIMIT $3  [["user_id", 39], ["ingredient_id", 2], ["LIMIT", 1]]
DELETE FROM "user_ingredients" WHERE "user_ingredients"."id" = $1  [["id", 12]]
---
  def destroy
    new_params = {user_id: current_user[:id], ingredient_id: params[:id]}
    @join = UserIngredient.find_by(new_params)
    @join.delete