waiter_app/app/controllers/user_dishes_controller.rb

INSERT INTO "user_dishes" ("user_id", "dish_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["dish_id", 3], ["created_at", "2018-04-05 00:43:16.206529"], ["updated_at", "2018-04-05 00:43:16.206529"]]
---
  def create
    new_params = {dish_id: params[:dish_id][0].to_i, user_id: params[:user_id][0].to_i}
    @join = UserDish.create(new_params)

SELECT  "user_dishes".* FROM "user_dishes" WHERE "user_dishes"."user_id" = $1 AND "user_dishes"."dish_id" = $2 LIMIT $3  [["user_id", 1], ["dish_id", 3], ["LIMIT", 1]]
DELETE FROM "user_dishes" WHERE "user_dishes"."id" = $1  [["id", 9]]
---
  def destroy
    new_params = {user_id: current_user[:id], dish_id: params[:id]}
    @join = UserDish.find_by(new_params)
    @join.delete