waiter_app/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @user = User.find(current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]
SELECT  "user_ingredients".* FROM "user_ingredients" WHERE "user_ingredients"."user_id" = $1 LIMIT $2  [["user_id", 5], ["LIMIT", 1]]
SELECT "user_dishes".* FROM "user_dishes" WHERE "user_dishes"."user_id" = $1  [["user_id", 9]]
---
  def destroy
    @user = User.find(params[:id])
    @user.delete
    @user.user_ingredients.each do |instance|
      instance.delete
    end
    @user.user_dishes.each do |instance|