waiter_app/app/views/ingredients/show.html.erb

<h2>All Dishes that include this ingredient</h2>
<% @ingredient.dishes.each do |dish| %>
---
SELECT "dishes".* FROM "dishes" INNER JOIN "ingredients_dishes" ON "dishes"."id" = "ingredients_dishes"."dish_id" WHERE "ingredients_dishes"."ingredient_id" = $1  [["ingredient_id", 1]]